---
kind: method
id: M:Autodesk.Revit.DB.Category.GetCategory(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.BuiltInCategory)
source: html/c3334f01-3294-3214-8dbf-d4bb79bb54b1.htm
---
# Autodesk.Revit.DB.Category.GetCategory Method

Retrieves a category object corresponding to a BuiltInCategory id.

## Syntax (C#)
```csharp
public static Category GetCategory(
	Document document,
	BuiltInCategory categoryId
)
```

## Parameters
- **document** (`Autodesk.Revit.DB.Document`) - The document.
- **categoryId** (`Autodesk.Revit.DB.BuiltInCategory`) - A built in category id.

## Returns
Returns a category object corresponding to a BuiltInCategory id.